name: "yolov5s"
platform: "onnxruntime_onnx"
max_batch_size: 0

input [
  {
    name: "images"
    data_type: TYPE_FLOAT32
    format: FORMAT_NONE
    dims: [1, 3, 640, 640]
    reshape {shape: [1, 3, 640, 640]}
  }
]
output [
  {
    name: "output0"
    data_type: TYPE_FLOAT32
    dims: [1,25200,85]
    reshape {shape: [1,25200,85]}
  }
]
instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [0]
  }
]